dangernoodle-io/breadboard/examples/smoke/sdkconfig.defaults.esp32c3
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_FREERTOS_HZ=1000
# Stack overflow detection: PTRVAL canary prints the overflowing task name
# instead of aborting silently. Recommended alongside bb_health stack
# monitor. See CONFIG_BB_TASK_REGISTRY_BASE_POLL_MS in bb_task_registry Kconfig.
# No FREERTOS_WATCHPOINT_END_OF_STACK here: C3 has SOC_ASSIST_DEBUG_SUPPORTED,
# so CONFIG_ESP_SYSTEM_HW_STACK_GUARD is already on by default -- a hardware
# SP-bounds check that's deterministic like the watchpoint but costs no
# per-task stack bytes and consumes no CPU watchpoint register.
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_PTRVAL=y
CONFIG_LOG_DEFAULT_LEVEL=3
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# Enable bb_log panic coredump capture
CONFIG_BB_DIAG_PANIC_COREDUMP=y
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y
CONFIG_BB_LOG_ROUTES=y
CONFIG_BB_OTA_PULL_AUTOREGISTER=y
# Enable RST-based SSE abort teardown (B1-517): bb_http_req_async_abort's
# SO_LINGER{on,0} setsockopt is inert without this — see bb_http.h.
CONFIG_LWIP_SO_LINGER=y
# Enable uxTaskGetSystemState (used by bb_task_registry's periodic base-scan
# and GET /api/diag/tasks) so per-task stack high-water-mark reporting is
# non-stub in smoke builds. See bb_task_registry Kconfig and
# platform/espidf/bb_task_registry/bb_task_registry_base_scan.c. Smoke-only:
# examples/floor deliberately stays minimal (B1-1296).
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
